1358484518/stm32h5f4tfm/trusted-firmware-m/platform/ext/target/stm/common/stm32h5xx/bl2/boot_hal_bl2.c
/**
  ******************************************************************************
  * @file    boot_hal_bl2.c
  * @author  MCD Application Team
  * @brief   This file contains  mcuboot stm32u5xx hardware specific implementation
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; SPDX-FileCopyrightText: Copyright The TrustedFirmware-M Contributors
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include <string.h>
#include <stdio.h>
#include "boot_hal_cfg.h"
#include "boot_hal.h"
#ifdef CRYPTO_HW_ACCELERATOR
#include "crypto_hw.h"
#endif
#include "mcuboot_config/mcuboot_config.h"
#if defined(MCUBOOT_DOUBLE_SIGN_VERIF)
#include "boot_hal_imagevalid.h"
#endif
#if defined(FLOW_CONTROL)
#include "boot_hal_flowcontrol.h"
#else
/* dummy definitions */
#define FLOW_CONTROL_STEP(C,B,A) ((void)0)
#define FLOW_CONTROL_CHECK(B,A) ((void)0)
#define FLOW_STAGE_CFG          (0x0)
#define FLOW_STAGE_CHK          (0x0)
#endif
#include "uart_stdout.h"
#include "low_level_security.h"
#ifdef BL2_DATA
#include "tfm_bl2_shared_data.h"
#endif
#include "bootutil/boot_record.h"
#include "target_cfg.h"
#include "tfm_hal_device_header.h"
#include "Driver_Flash.h"
#include "region_defs.h"
#ifdef EXTERNAL_FLASH
#include "flash_map/flash_map.h"
#include "low_level_spi_flash.h"
#endif
#include "low_level_rng.h"
#ifdef MCUBOOT_EXT_LOADER
#include "bootutil/crypto/sha256.h"
#define BUTTON_PORT                       GPIOC
#define BUTTON_CLK_ENABLE                 __HAL_RCC_GPIOC_CLK_ENABLE()
#define BUTTON_PIN                        GPIO_PIN_13
#endif /* MCUBOOT_EXT_LOADER */
#include "template/flash_otp_nv_counters_backend.h"
#include "nv_counters.h"

#ifdef BL2_OTP_AREA_BASE
extern  struct flash_otp_nv_counters_region_t otp_stm_provision;
#define OTP_KEEP otp_stm_provision.init_value
#else
#define OTP_KEEP (0)
#endif

#ifdef BL2_NVM_AREA_BASE
extern  struct nv_counters_t nvm_init;
#define NVM_KEEP nvm_init.init_value
#else
#define NVM_KEEP (0)
#endif

#ifdef BL2_NVMCNT_AREA_BASE
extern  struct nv_counters_t nvmcnt_init;
#define NVMCNT_KEEP nvmcnt_init.init_value
#else
#define NVMCNT_KEEP (0)
#endif

extern HAL_StatusTypeDef HAL_ICACHE_Invalidate(void);
extern int  LL_SECU_UpdateRunTimeProtections(void);
extern HAL_StatusTypeDef HAL_ICACHE_Enable(void);
extern void LL_SECU_ApplyRunTimeProtections(void);
extern void LL_SECU_CheckStaticProtections(void);

/* Flash device names must be specified by target */
#ifdef FLASH_DEV_NAME
extern ARM_DRIVER_FLASH FLASH_DEV_NAME;
#endif /* FLASH_DEV_NAME */
#ifdef FLASH_DEV_NAME_2
extern ARM_DRIVER_FLASH FLASH_DEV_NAME_2;
#endif /* FLASH_DEV_NAME_2 */
#ifdef FLASH_DEV_NAME_3
extern ARM_DRIVER_FLASH FLASH_DEV_NAME_3;
#endif /* FLASH_DEV_NAME_3 */
#ifdef FLASH_DEV_NAME_SCRATCH
extern ARM_DRIVER_FLASH FLASH_DEV_NAME_SCRATCH;
#endif /* FLASH_DEV_NAME_SCRATCH */

#if defined(EXTERNAL_FLASH)
#include "bootutil/bootutil_log.h"

int flash_device_base(uint8_t fd_id, uintptr_t *ret)
{
    switch (fd_id) {
    case FLASH_DEVICE_ID:
        *ret = FLASH_DEVICE_BASE;
        break;
    case SPI_FLASH_DEV_ID:
        *ret = SPI_FLASH_BASE_ADDRESS;
        break;
    default:
        BOOT_LOG_ERR("invalid flash ID %d; expected %d",
                     fd_id, FLASH_DEVICE_ID);
        *ret = (uintptr_t)-1;
        return -1;
    }
    return 0;
}
#endif /* EXTERNAL_FLASH */

#if defined(MCUBOOT_DOUBLE_SIGN_VERIF)
/* Global variables to memorize images validation status */
#if (MCUBOOT_IMAGE_NUMBER == 1)
uint8_t ImageValidStatus[MCUBOOT_IMAGE_NUMBER] = {IMAGE_INVALID};
#elif (MCUBOOT_IMAGE_NUMBER == 2)
uint8_t ImageValidStatus[MCUBOOT_IMAGE_NUMBER] = {IMAGE_INVALID, IMAGE_INVALID};
#else
#error "MCUBOOT_IMAGE_NUMBER not supported"
#endif /* (MCUBOOT_IMAGE_NUMBER == 1)  */
uint8_t ImageValidIndex = 0;
uint8_t ImageValidEnable = 0;
#endif /* MCUBOOT_DOUBLE_SIGN_VERIF */

#if defined(FLOW_CONTROL)
/* Global variable for Flow Control state */
volatile uint32_t uFlowProtectValue = FLOW_CTRL_INIT_VALUE;
#endif /* FLOW_CONTROL */
volatile uint32_t uFlowStage = FLOW_STAGE_CFG;

/*
#define ICACHE_MONITOR
*/
#if defined(ICACHE_MONITOR)
#define ICACHE_MONITOR_PRINT() printf("icache monitor - Hit: %x, Miss: %x\r\n", \
                                      HAL_ICACHE_Monitor_GetHitValue(), HAL_ICACHE_Monitor_GetMissValue());
#else
#define ICACHE_MONITOR_PRINT()
#endif /* ICACHE_MONITOR */

/* Private function prototypes -----------------------------------------------*/
/** @defgroup BOOT_HAL_Private_Functions  Private Functions
  * @{
  */
#ifdef MCUBOOT_EXT_LOADER
__NO_RETURN void execute_loader(void);
#endif /* MCUBOOT_EXT_LOADER */
void boot_clean_ns_ram_area(void);
__attribute__((naked)) void boot_jump_to_ns_image(uint32_t reset_handler_addr);
void icache_init(void);
/**
  * @}
  */
#ifdef MCUBOOT_EXT_LOADER
/**
  * @brief This function manage the jump to Local loader application.
  * @note
  * @retval void
  */
void boot_platform_noimage(void)
{
    /* Check Flow control for dynamic protections */
    FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_STAGE_2);
    uFlowStage = FLOW_STAGE_CFG;
    /* unsecure all pin configuration ,non secure loader is initializing Octospi pin*/
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();
    __HAL_RCC_GPIOE_CLK_ENABLE();
    __HAL_RCC_GPIOF_CLK_ENABLE();
    __HAL_RCC_GPIOG_CLK_ENABLE();
    __HAL_RCC_GPIOH_CLK_ENABLE();
    GPIOA_S->SECCFGR = 0x0;
    GPIOB_S->SECCFGR = 0x0;
    GPIOC_S->SECCFGR = 0x0;
    GPIOD_S->SECCFGR = 0x0;
    GPIOE_S->SECCFGR = 0x0;
    GPIOF_S->SECCFGR = 0x0;
    GPIOG_S->SECCFGR = 0x0;
    GPIOH_S->SECCFGR = 0x0;
#if defined(MCUBOOT_PRIMARY_ONLY)
    /* loader code is set secure after control being set successfully */
    /* MPU allowing execution of this area is set after HDP activation */
    LL_SECU_SetLoaderCodeSecure();

