1358484518/stm32h5f4tfm/trusted-firmware-m/platform/ext/target/stm/common/stm32h5xx/bl2/boot_hal_bl2.c
   (void)fih_delay();
    /* Check again if images have been validated, to resist to basic hw attacks */
    for (image_index = 0; image_index < MCUBOOT_IMAGE_NUMBER; image_index++)
    {
        if (ImageValidStatus[image_index] != IMAGE_VALID)
        {
            BOOT_LOG_ERR("Error while double controlling images validation");
            Error_Handler();
        }
    }
#endif /* MCUBOOT_DOUBLE_SIGN_VERIF */

    /* Check Flow control state */
    FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_STAGE_2);
    uFlowStage = FLOW_STAGE_CFG;

    /* Copy shared data in SRAM for Secure services */
#ifdef BL2_DATA
    TFM_BL2_CopySharedData();
#endif
#ifdef CRYPTO_HW_ACCELERATOR
    (void)crypto_hw_accelerator_finish();
#endif

    RNG_DeInit();

#ifdef FLASH_DEV_NAME
    if (FLASH_DEV_NAME.Uninitialize() != ARM_DRIVER_OK)
    {
        BOOT_LOG_ERR("Error while uninitializing Flash Interface");
        Error_Handler();
    }
#endif /* FLASH_DEV_NAME */
#ifdef FLASH_DEV_NAME_2
    if (FLASH_DEV_NAME_2.Uninitialize() != ARM_DRIVER_OK)
    {
        BOOT_LOG_ERR("Error while uninitializing Flash Interface");
        Error_Handler();
    }
#endif /* FLASH_DEV_NAME_2 */
#ifdef FLASH_DEV_NAME_3
    if (FLASH_DEV_NAME_3.Uninitialize() != ARM_DRIVER_OK)
    {
        BOOT_LOG_ERR("Error while uninitializing Flash Interface");
        Error_Handler();
    }
#endif /* FLASH_DEV_NAME_3 */
#ifdef FLASH_DEV_NAME_SCRATCH
    if (FLASH_DEV_NAME_SCRATCH.Uninitialize() != ARM_DRIVER_OK)
    {
        BOOT_LOG_ERR("Error while uninitializing Flash Interface");
        Error_Handler();
    }
#endif /* FLASH_DEV_NAME_SCRATCH */

    ICACHE_MONITOR_PRINT()

#ifdef TFM_ICACHE_ENABLE
    /* Invalidate ICache before jumping to application */
    if (HAL_ICACHE_Invalidate() != HAL_OK)
    {
        Error_Handler();
    }
#endif /* ICACHE_ENABLED */
    /* Update run time protections for application execution */
    LL_SECU_UpdateRunTimeProtections();

    /* set the secure vector */
    SCB->VTOR = (uint32_t)vector;

    vt = (struct boot_arm_vector_table *)vector;
    /* Check Flow control state */
    FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_STAGE_3_A);
    uFlowStage = FLOW_STAGE_CHK;

    /* Double the update of run time protections, to resist to basic hardware attacks */
    LL_SECU_UpdateRunTimeProtections();

    /* Check Flow control for dynamic protections */
    FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_STAGE_4_A);
    /*  change stack limit  */
    __set_MSPLIM(0);
    /* Restore the Main Stack Pointer Limit register's reset value
     * before passing execution to runtime firmware to make the
     * bootloader transparent to it.
     */
    __set_MSP(vt->msp);
    __DSB();
    __ISB();

    boot_stm_jump_to_next_image((uint32_t)&boot_stm_jump_to_next_image, vt->reset);
    /* Avoid compiler to pop registers after having changed MSP */
#if !defined(__ICCARM__)
    __builtin_unreachable();
#endif /* defined(__ICCARM__) */
}

/* Continue to place code in a specific section */
#if defined(__GNUC__)
__attribute__((section(".BL2_NoHdp_Code")))

/* Ensure local variables of this function are not placed in RAM but in
 * registers only, even in case of low compile optimization configuration
 * at project side.
 * - IAR: No need to force compile optimization level.
 * - KEIL: Force high compile optimization on per-file basis.
 * - STM32CUBEIDE: Force high compile optimization on function only.
 *  */
#if !defined(__ARMCC_VERSION)
__attribute__((optimize("Os")))
#endif /* !__ARMCC_VERSION */
#endif /* __GNUC__ */

/**
  * @brief This function is called to clear all RAM area before jumping in
  * in Secure application .
  * @note
  * @retval void
  */
void boot_clear_bl2_ram_area(void)
{
    __IO uint32_t *pt = (uint32_t *)BL2_DATA_START;
    uint32_t index;


    for (index = 0; index < (BL2_DATA_SIZE / 4); index++)
    {
        pt[index] = 0;
    }

}

/* Continue to place code in a specific section */
#if defined(__GNUC__)
__attribute__((section(".BL2_NoHdp_Code")))
/* Ensure local variables of this function are not placed in RAM but in
 * registers only, even in case of low compile optimization configuration
 * at project side.
 * - IAR: No need to force compile optimization level.
 * - KEIL: Force high compile optimization on per-file basis.
 * - STM32CUBEIDE: Force high compile optimization on function only.
 *  */
#if !defined(__ARMCC_VERSION)
__attribute__((optimize("Os")))
#endif /* !__ARMCC_VERSION */
#endif /* __GNUC__ */

/**
  * @brief This function is called to clear all RAM area before jumping in
  * in Secure application .
  * @note
  * @retval void
  */
void  boot_clean_ns_ram_area(void)
{
#ifdef TFM_ERROR_HANDLER_NON_SECURE
    __IO uint32_t *pt = (uint32_t *)(SRAM1_BASE + 256);
#else /*  TFM_ERROR_HANDLER_NON_SECURE */
    __IO uint32_t *pt = (uint32_t *)SRAM1_BASE;
#endif /* TFM_ERROR_HANDLER_NON_SECURE */
    uint32_t index;
    /* clean all SRAM1 */
    for (index = 0; index < (_SRAM1_SIZE_MAX / 4); index++)
    {
        pt[index] = 0;
    }
    /* unsecure all SRAM1 */
    for (index = 0; index < 24 ; index++)
    {
        /* assume loader is only in SRAM1 */
        GTZC_MPCBB1_S->SECCFGR[index] = 0;
    }
    pt = (uint32_t *)BL2_DATA_START;
    for (index = 0; index < (BL2_DATA_SIZE / 4); index++)
    {
        pt[index] = 0;
    }
}

/* Stop placing data in specified section */
#if defined(__ICCARM__)
#pragma default_function_attributes =
#endif /* __ICCARM__ */



/**
  * @brief This function configures and enables the ICache.
  * @note
  * @retval execution_status
  */
void icache_init(void)
{
#ifdef ICACHE_MONITOR
    if (HAL_ICACHE_Monitor_Reset(ICACHE_MONITOR_HIT_MISS) != HAL_OK)
    {
        Error_Handler();
    }
    if (HAL_ICACHE_Monitor_Start(ICACHE_MONITOR_HIT_MISS) != HAL_OK)
    {
        Error_Handler();
    }
#endif /* ICACHE_MONITOR */
    ICACHE_MONITOR_PRINT()

    /* Enable ICache */
    if (HAL_ICACHE_Enable() != HAL_OK)
    {
        Error_Handler();
    }
}

/* exported variables --------------------------------------------------------*/

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/

/**
  * @brief  Platform init
  * @param  None
  * @retval status
  */
int32_t boot_platform_init(void)
{
#ifdef MCUBOOT_EXT_LOADER
    GPIO_InitTypeDef GPIO_Init;
#endif /* MCUBOOT_EXT_LOADER */
    /* STM32U5xx HAL library initialization:
         - Systick timer is configured by default as source of time base, but user
               can eventually implement his proper time base source (a general purpose
               timer for example or other time source), keeping in mind that Time base
               duration should be kept 1ms since PPP_TIMEOUT_VALUEs are defined and
               handled in milliseconds basis.
         - Set NVIC Group Priority to 3
         - Low Level Initialization
       */
    /*  Place here to force linker to keep provision and init const */
     __IO uint32_t otp = OTP_KEEP;
     __IO uint32_t nvm = NVM_KEEP;
     __IO uint32_t nvmcnt = NVMCNT_KEEP;
    (void)otp;
    (void)nvm;
    (void)nvmcnt;
    HAL_Init();
#ifdef TFM_DEV_MODE
    /* Init for log */
    stdio_init();
#endif /*  TFM_DEV_MODE */

#ifdef TFM_ICACHE_ENABLE
    /* Configure and enable ICache */
    icache_init();
#endif /* ICACHE_ENABLED */

    /* Initialize RNG */
    if (RNG_Init()){
      BOOT_LOG_ERR("Error while initializing RNG Ip");
      Error_Handler();
    }
#ifdef CRYPTO_HW_ACCELERATOR
    if (crypto_hw_accelerator_init()){
      BOOT_LOG_ERR("Error while initializing HW accelerator Ip");
      Error_Handler();
    }
#endif
    /* Start HW randomization */
    fih_delay_init();
    /* Apply Run time Protection */
    LL_SECU_ApplyRunTimeProtections();
    /* Check static protections */
    LL_SECU_CheckStaticProtections();

