1358484518/stm32h5f4tfm/trusted-firmware-m/platform/ext/target/stm/common/stm32h5xx/bl2/boot_hal_bl2.c
    /* Check Flow control state */
    FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_STAGE_1);
    uFlowStage = FLOW_STAGE_CHK;
    /* Double protections apply / check to resist to basic fault injections */
    /* Apply Run time Protection */
   (void)fih_delay();
    LL_SECU_ApplyRunTimeProtections();
    /* Check static protections */
    LL_SECU_CheckStaticProtections();

#ifdef FLASH_DEV_NAME
    if (FLASH_DEV_NAME.Initialize(NULL) != ARM_DRIVER_OK)
    {
        BOOT_LOG_ERR("Error while initializing Flash Interface");
        Error_Handler();
    }
#endif /* FLASH_DEV_NAME */
#ifdef FLASH_DEV_NAME_2
    {
        uint8_t jedec[3] = {0, 0, 0};
        int32_t spi_rc;

        spi_rc = FLASH_DEV_NAME_2.Initialize(NULL);
        /* Probe again after init so the ID is always on the BL2 console,
         * including LOG_LEVEL_ERROR / prod builds (BOOT_LOG_ERR).
         */
        (void)w25q32_read_jedec_id(jedec);
        BOOT_LOG_ERR("W25Q32 JEDEC ID %02x:%02x:%02x (expect ef:40:16)",
                     jedec[0], jedec[1], jedec[2]);
        if (spi_rc != ARM_DRIVER_OK) {
            BOOT_LOG_ERR("SPI NOR init failed; continue with internal primary");
        }
    }
#endif /* FLASH_DEV_NAME_2 */
#if defined(FLASH_DEV_NAME_3) && !defined(FLASH_DEV_NAME_2)
    if (FLASH_DEV_NAME_3.Initialize(NULL) != ARM_DRIVER_OK)
    {
        BOOT_LOG_ERR("Error while initializing SPI Flash Interface");
        Error_Handler();
    }
#endif /* FLASH_DEV_NAME_3 && !FLASH_DEV_NAME_2 */
#ifdef FLASH_DEV_NAME_SCRATCH
    if (FLASH_DEV_NAME_SCRATCH.Initialize(NULL) != ARM_DRIVER_OK)
    {
        BOOT_LOG_ERR("Error while initializing Flash Interface");
        Error_Handler();
    }
#endif /* FLASH_DEV_NAME_SCRATCH */


#ifdef MCUBOOT_EXT_LOADER
    /* configure Button pin */
    BUTTON_CLK_ENABLE;
    GPIO_Init.Pin       = BUTTON_PIN;
    GPIO_Init.Mode      = 0;
    GPIO_Init.Speed     = GPIO_SPEED_FREQ_HIGH;
    GPIO_Init.Pull      = GPIO_NOPULL;
    GPIO_Init.Alternate = 0;
    HAL_GPIO_Init(BUTTON_PORT, &GPIO_Init);
    /* read pin value */
    if (HAL_GPIO_ReadPin(BUTTON_PORT, BUTTON_PIN) == GPIO_PIN_SET)
    {
        boot_platform_noimage();
    }
#endif /* MCUBOOT_EXT_LOADER */
    return 0;
}

/**
  * @brief  This function is executed in case of error occurrence.
  *         This function does not return.
  * @param  None
  * @retval None
  */
#ifdef TFM_ERROR_HANDLER_NON_SECURE
/* Place code in a specific section */
#if defined(__ICCARM__)
#pragma default_function_attributes = @ ".BL2_Error_Code"
#else
__attribute__((section(".BL2_Error_Code")))
#endif /* __ICCARM__ */
void Error_Handler(void)
{
#define WHILE_1_OPCODE 0xe7fe
    typedef void (*nsfptr_t)(void) __attribute__((cmse_nonsecure_call));
    nsfptr_t nsfptr = (nsfptr_t)(SRAM1_BASE_NS + 1);
    __IO uint16_t *pt = (uint16_t *)SRAM1_BASE_NS;
    /*  copy while(1) instruction */
    *pt = WHILE_1_OPCODE;
    /* Flush and refill pipeline  */
    __DSB();
    __ISB();
    /*  call non secure while(1) */
    nsfptr();
}
#else /* TFM_ERROR_HANDLER_NON_SECURE */
/* Place code in a specific section */
#if defined(__ICCARM__)
#pragma default_function_attributes = @ ".BL2_Error_Code"
__NO_RETURN void Error_Handler_rdp(void)
#else
__attribute__((section(".BL2_Error_Code")))
void Error_Handler_rdp(void)
#endif
{
    /* it is customizeable */
    /* an infinite loop,  and a reset for single fault injection */
    static __IO int twice = 0;
    while (!twice);
    NVIC_SystemReset();
#if !defined(__ICCARM__)
    /* Avoid bx lr instruction (for fault injection) */
    __builtin_unreachable();
#endif /* defined(__ICCARM__) */
}
/* Place code in a specific section */
#if defined(__ICCARM__)
#pragma default_function_attributes = @ ".BL2_Error_Code"
__NO_RETURN void Error_Handler(void)
#else
__attribute__((section(".BL2_Error_Code")))
void Error_Handler(void)
#endif
{
    /* It is customizeable */
    NVIC_SystemReset();
#if !defined(__ICCARM__)
    /* Avoid bx lr instruction (for fault injection) */
    __builtin_unreachable();
#endif /* defined(__ICCARM__) */
}
#endif /* TFM_ERROR_HANDLER_NON_SECURE */

/* Stop placing data in specified section */
#if defined(__ICCARM__)
#pragma default_function_attributes =
#endif /* __ICCARM__ */

#if defined(__ARMCC_VERSION)
/* reimplement the function to reach Error Handler */
void __aeabi_assert(const char *expr, const char *file, int line)
{
#ifdef TFM_DEV_MODE
    printf("assertion \" %s \" failed: file %s %d\n", expr, file, line);
#endif /*  TFM_DEV_MODE  */
    Error_Handler();
}
#endif  /*  __ARMCC_VERSION */
#ifdef  USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
    /* User can add his own implementation to report the file name and line number,
       ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

    Error_Handler();
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
